# DataFrame 정제 
: NaN으로 빠진 값이나 정상적이지 않은 값(결측치(missing value), 이상치) 정제

In [1]:
# DF, Numbers
import numpy as np 
import pandas as pd

In [2]:
# numpy의 난수를 이용하여 DF 만들기 
df = pd.DataFrame(np.random.rand(6,4))
df

          0         1         2         3
0  0.740845  0.575227  0.346386  0.255332
1  0.862708  0.419755  0.179501  0.967176
2  0.995374  0.510392  0.824140  0.158532
3  0.041069  0.963996  0.643060  0.978647
4  0.893970  0.981578  0.638220  0.980152
5  0.487139  0.200631  0.568083  0.512313

In [3]:
# Column, Index 이름 넣기 
df.columns = 'A','B','C','D'
df

          A         B         C         D
0  0.740845  0.575227  0.346386  0.255332
1  0.862708  0.419755  0.179501  0.967176
2  0.995374  0.510392  0.824140  0.158532
3  0.041069  0.963996  0.643060  0.978647
4  0.893970  0.981578  0.638220  0.980152
5  0.487139  0.200631  0.568083  0.512313

In [4]:
df.index = pd.date_range("20220701", periods=6)
df

                   A         B         C         D
2022-07-01  0.740845  0.575227  0.346386  0.255332
2022-07-02  0.862708  0.419755  0.179501  0.967176
2022-07-03  0.995374  0.510392  0.824140  0.158532
2022-07-04  0.041069  0.963996  0.643060  0.978647
2022-07-05  0.893970  0.981578  0.638220  0.980152
2022-07-06  0.487139  0.200631  0.568083  0.512313

In [5]:
# index type 확인 
df.index

DatetimeIndex(['2022-07-01', '2022-07-02', '2022-07-03', '2022-07-04',
               '2022-07-05', '2022-07-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
# 새로운 F열 생성, 값 입력 
df['F'] = 1.0, np.nan, 3.5, 6.1, np.nan, 7.0
df

                   A         B         C         D    F
2022-07-01  0.740845  0.575227  0.346386  0.255332  1.0
2022-07-02  0.862708  0.419755  0.179501  0.967176  NaN
2022-07-03  0.995374  0.510392  0.824140  0.158532  3.5
2022-07-04  0.041069  0.963996  0.643060  0.978647  6.1
2022-07-05  0.893970  0.981578  0.638220  0.980152  NaN
2022-07-06  0.487139  0.200631  0.568083  0.512313  7.0

In [7]:
# NaN이 하나라도 있는 data(행) 삭제 
df.dropna(how='any') # how = 'any' : 하나라도 있으면 다 지우는 게 default 
# -- inplace 안하면 적용되는 것 아님 !

                   A         B         C         D    F
2022-07-01  0.740845  0.575227  0.346386  0.255332  1.0
2022-07-03  0.995374  0.510392  0.824140  0.158532  3.5
2022-07-04  0.041069  0.963996  0.643060  0.978647  6.1
2022-07-06  0.487139  0.200631  0.568083  0.512313  7.0

In [8]:
# NaN이 모든 열에 data로 있는 경우에 data(행) 삭제
# - 한 행의 데이터가 모두 NaN일 경우에 지운다 
df.dropna(how = 'all')

                   A         B         C         D    F
2022-07-01  0.740845  0.575227  0.346386  0.255332  1.0
2022-07-02  0.862708  0.419755  0.179501  0.967176  NaN
2022-07-03  0.995374  0.510392  0.824140  0.158532  3.5
2022-07-04  0.041069  0.963996  0.643060  0.978647  6.1
2022-07-05  0.893970  0.981578  0.638220  0.980152  NaN
2022-07-06  0.487139  0.200631  0.568083  0.512313  7.0

In [9]:
# NaN을 특정값으로 변경하기 
df.fillna(value=5.0)

                   A         B         C         D    F
2022-07-01  0.740845  0.575227  0.346386  0.255332  1.0
2022-07-02  0.862708  0.419755  0.179501  0.967176  5.0
2022-07-03  0.995374  0.510392  0.824140  0.158532  3.5
2022-07-04  0.041069  0.963996  0.643060  0.978647  6.1
2022-07-05  0.893970  0.981578  0.638220  0.980152  5.0
2022-07-06  0.487139  0.200631  0.568083  0.512313  7.0

In [10]:
# Boolean Index를 통해 검색 및 변경 
df.isnull()

                A      B      C      D      F
2022-07-01  False  False  False  False  False
2022-07-02  False  False  False  False   True
2022-07-03  False  False  False  False  False
2022-07-04  False  False  False  False  False
2022-07-05  False  False  False  False   True
2022-07-06  False  False  False  False  False

In [11]:
# F열에서 NaN을 포함하고 있는 행 찾기 
df.loc[df.isnull()['F'],:]

                   A         B         C         D   F
2022-07-02  0.862708  0.419755  0.179501  0.967176 NaN
2022-07-05  0.893970  0.981578  0.638220  0.980152 NaN

In [12]:
# Index를 이용하여 행 제거  
df.drop("2022-07-01") # axis = 0이 default (행이 디폴트!)

                   A         B         C         D    F
2022-07-02  0.862708  0.419755  0.179501  0.967176  NaN
2022-07-03  0.995374  0.510392  0.824140  0.158532  3.5
2022-07-04  0.041069  0.963996  0.643060  0.978647  6.1
2022-07-05  0.893970  0.981578  0.638220  0.980152  NaN
2022-07-06  0.487139  0.200631  0.568083  0.512313  7.0

In [13]:
# 날짜 다룰 때는 type을 맞춰서 해주는 게 좋음 
df.drop(pd.to_datetime("20220701"))

                   A         B         C         D    F
2022-07-02  0.862708  0.419755  0.179501  0.967176  NaN
2022-07-03  0.995374  0.510392  0.824140  0.158532  3.5
2022-07-04  0.041069  0.963996  0.643060  0.978647  6.1
2022-07-05  0.893970  0.981578  0.638220  0.980152  NaN
2022-07-06  0.487139  0.200631  0.568083  0.512313  7.0

In [14]:
df.drop([pd.to_datetime("20220701"), pd.to_datetime("20220702")])

                   A         B         C         D    F
2022-07-03  0.995374  0.510392  0.824140  0.158532  3.5
2022-07-04  0.041069  0.963996  0.643060  0.978647  6.1
2022-07-05  0.893970  0.981578  0.638220  0.980152  NaN
2022-07-06  0.487139  0.200631  0.568083  0.512313  7.0

In [15]:
df

                   A         B         C         D    F
2022-07-01  0.740845  0.575227  0.346386  0.255332  1.0
2022-07-02  0.862708  0.419755  0.179501  0.967176  NaN
2022-07-03  0.995374  0.510392  0.824140  0.158532  3.5
2022-07-04  0.041069  0.963996  0.643060  0.978647  6.1
2022-07-05  0.893970  0.981578  0.638220  0.980152  NaN
2022-07-06  0.487139  0.200631  0.568083  0.512313  7.0

In [16]:
# 열삭제 
# - del: inplace 안해도 지워짐. inplace 할 곳 도 없음 
del df['F']

In [17]:
# - drop : inplace 해줘야 함  
df.drop('F', axis = 1) # axis = 'columns'

KeyError: "['F'] not found in axis"

In [ ]:
df.drop(['B','F'], axis = 1)

                   A         C         D
2022-07-01  0.846816  0.096234  0.904424
2022-07-02  0.747643  0.582349  0.206033
2022-07-03  0.202793  0.350063  0.390556
2022-07-04  0.502580  0.330419  0.890170
2022-07-05  0.607637  0.474306  0.589243
2022-07-06  0.280200  0.037939  0.388514

---
## 분석용 함수 사용하기

In [ ]:
df = pd.DataFrame({'one':[1.4, 7.1, np.nan, 0.75], 'two':[np.nan, -4.5, np.nan, -1.3]}, index = ['a','b','c','d'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [ ]:
# 행방향 합계 구하기 
df.sum(axis=0)
df.sum(axis="rows")

one    9.25
two   -5.80
dtype: float64

In [ ]:
# 열방향 합계 구하기 
df.sum(axis="columns")
# - nan + nan = nan(0)으로 나옴 
# - nan 있어도 계산 함

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [ ]:
df.loc["b"].sum()

2.5999999999999996

In [ ]:
# 평균 구하기 
df.mean(axis='rows')

one    3.083333
two   -2.900000
dtype: float64

In [ ]:
# 분산 구하기 
df.var(axis='rows')

one    12.205833
two     5.120000
dtype: float64

In [ ]:
# nan 있는거 계산하지 말아라 (nan 신경써라. 0으로 맘대로 하지 말고.)
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [ ]:
# nan 스킵하면 a 행의 nan을 무시 함 
df.mean(axis='columns')

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [ ]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [ ]:
# one 컬럼의 NaN은 남은 값들의 평균으로 대체, two의 NaN은 가장 작은 값으로 대체 
df.one.fillna(value=df.one.mean(), inplace=True)
df.two.fillna(value=df.two.min(), inplace=True)
df

        one  two
a  1.400000 -4.5
b  7.100000 -4.5
c  3.083333 -4.5
d  0.750000 -1.3

In [ ]:
# 평균값 구하기 
one_mean = df.mean(axis=0)['one']
one_mean

3.0833333333333335

In [ ]:
two_min = df.min(axis=0)['two']
two_min

-4.5

In [ ]:
df['one']= df['one'].fillna(value=one_mean)
df['two'] = df['two'].fillna(value=two_min)

In [ ]:
df

        one  two
a  1.400000 -4.5
b  7.100000 -4.5
c  3.083333 -4.5
d  0.750000 -1.3

---
## DataFrame Merging (병합)

In [ ]:
df1 = pd.DataFrame({'key':list('bbacaab'), 'data1':range(7)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [ ]:
df2 = pd.DataFrame({'key':list('abd'), 'data2':range(3)})
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [ ]:
# 병합하기 
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

> key c,d는 서로 매치되지 않아 출력 하지 않음

In [ ]:
# 모두 보이기 
pd.merge(df1, df2, on='key', how='outer') # how = inner 가 default

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [ ]:
# df1 기준으로 merge 
pd.merge(df1, df2, on='key',how='left')

  key  data1  data2
0   b      0    1.0
1   b      1    1.0
2   a      2    0.0
3   c      3    NaN
4   a      4    0.0
5   a      5    0.0
6   b      6    1.0

In [ ]:
# df2 기준으로 merge 
pd.merge(df1, df2, on='key',how='right')

  key  data1  data2
0   a    2.0      0
1   a    4.0      0
2   a    5.0      0
3   b    0.0      1
4   b    1.0      1
5   b    6.0      1
6   d    NaN      2

#### 두개의 DF에 중복된 값이 있을 경우

In [ ]:
df1 = pd.DataFrame({'key':list('bbacab'), 'data1' : range(6)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [ ]:
df2 = pd.DataFrame({'key':list('ababd'), 'data2' : range(5)})
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [ ]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

#### key name 이 다를 경우

In [ ]:
df1 = pd.DataFrame({'lkey':list('bbacab'), 'data1' : range(6)})
df1

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    b      5

In [ ]:
df2 = pd.DataFrame({'rkey':list('ababd'), 'data2' : range(5)})
df2

  rkey  data2
0    a      0
1    b      1
2    a      2
3    b      3
4    d      4

In [ ]:
pd.merge(df1,df2, left_on='lkey',right_on='rkey', how="inner")

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      0    b      3
2    b      1    b      1
3    b      1    b      3
4    b      5    b      1
5    b      5    b      3
6    a      2    a      0
7    a      2    a      2
8    a      4    a      0
9    a      4    a      2

In [ ]:
#### 하나의 key 값으로 병합하는 경우 
df1 = pd.DataFrame({'key':list('bbacab'), 'data1' : range(6)})
df2 = pd.DataFrame({'group_val':[3.5,7]}, index = ['a','b'])
df2

   group_val
a        3.5
b        7.0

In [ ]:
pd.merge(df1, df2, left_on='key', right_index=True)

  key  data1  group_val
0   b      0        7.0
1   b      1        7.0
5   b      5        7.0
2   a      2        3.5
4   a      4        3.5

--- 
## Data Concatenating (연결)

In [ ]:
s1 = pd.Series([0,1], index=['a','b'])
s1

a    0
b    1
dtype: int64

In [ ]:
s2 = pd.Series([2,3,4], index=['c','d','e'])
s2

c    2
d    3
e    4
dtype: int64

In [ ]:
s3 = pd.Series([5,6], index=['f','g'])
s3

f    5
g    6
dtype: int64

In [ ]:
# s1, s2, s3 합치기 
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [ ]:
# Series를 합치면서 DF 만들기 
pd.concat([s1, s2, s3], axis=1, sort=True)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [ ]:
# 컬럼 이름 넣기 
pd.concat([s1, s2, s3], axis=1, sort=True, keys=['s1','s2','s3'])

    s1   s2   s3
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0


### DF의 Concatenation

In [ ]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2), index=['a','b','c'], columns=['one','two'])

In [ ]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [ ]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2,2), index=['a','c'], columns =['three','four'])

In [ ]:
df2

   three  four
a      5     6
c      7     8

In [ ]:
# df1 + df2 
pd.concat([df1, df2], axis = 1, sort=True)

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0

In [ ]:
pd.concat([df1, df2], axis = 1, sort=True, ignore_index=True)

   0  1    2    3
a  0  1  5.0  6.0
b  2  3  NaN  NaN
c  4  5  7.0  8.0

In [ ]:
pd.concat([df1, df2], axis = 0, sort=True, ignore_index=True)

   four  one  three  two
0   NaN  0.0    NaN  1.0
1   NaN  2.0    NaN  3.0
2   NaN  4.0    NaN  5.0
3   6.0  NaN    5.0  NaN
4   8.0  NaN    7.0  NaN

--- 
## DataFrame 중복값 제거

In [ ]:
df = pd.DataFrame({'k1':['one']*3 + ['two']*4, 'k2':[1,1,2,3,3,4,4]})
df

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [ ]:
# 중복값 확인 
df.duplicated()
# - 맨 처음 나오는 데이터는 항상 False, 앞에 나온 게 또 나오면 중복 True

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [ ]:
# 중복값 제거 
df.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [ ]:
df['v1'] = np.arange(7)
df

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [ ]:
df['k1'].drop_duplicates()

0    one
3    two
Name: k1, dtype: object

In [ ]:
df

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [ ]:
# k1의 값들로 중복값 제거 
df.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
3  two   3   3

In [ ]:
# k1의 값들로 마지막 값으로 출력 
df.drop_duplicates(['k1'], keep='last')

    k1  k2  v1
2  one   2   2
6  two   4   6

---
## Category 사용하기

In [ ]:
df3 = pd.DataFrame({'id':[1,2,3,4,5,6],
                    'raw_grade': ['a','b','b','a','a','e']})
df3

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [ ]:
# category 자료형으로 변환하기 
df3['grade'] = df3['raw_grade'].astype('category')
df3

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         b     b
3   4         a     a
4   5         a     a
5   6         e     e

In [ ]:
df3.dtypes

id              int64
raw_grade      object
grade        category
dtype: object

In [ ]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   raw_grade  6 non-null      object
 2   grade      6 non-null      category
dtypes: category(1), int64(1), object(1)
memory usage: 362.0+ bytes

In [ ]:
# category를 이용하여 자료 변형하기 
df3['grade'].cat.categories = ['very good','good','very bad']
df3

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [ ]:
df3.sort_values(by='grade')

   id raw_grade      grade
0   1         a  very good
3   4         a  very good
4   5         a  very good
1   2         b       good
2   3         b       good
5   6         e   very bad

In [ ]:
df3['grade']

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (3, object): ['very good', 'good', 'very bad']

### 데이터의 범위 정하기

In [ ]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]
bins=[18,25,35,60,100]

In [ ]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [ ]:
# 범주 관련 code 보기 
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [ ]:
# 범주 관련 빈도수 보기 
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [ ]:
# category 이름 정하기 
group_names = ['Youth','YoungAdult','MiddleAged','Senior']
cat2 = pd.cut(ages, bins, labels=group_names)
cat2.value_counts()

Youth         5
YoungAdult    3
MiddleAged    3
Senior        1
dtype: int64